In [1]:
from sklearn.preprocessing import LabelEncoder
import numpy as np
import pandas as pd

In [24]:
### 라벨 인코딩할 컬럼이 1개인 경우

In [3]:
계절 = ['봄', '여름', '가을', '겨울']

In [4]:
# df = index + Series들
# Series = index + values(ndarray)

In [5]:
# df에서 하나의 열은 Series

In [6]:
data = pd.Series(계절)
data

0     봄
1    여름
2    가을
3    겨울
dtype: object

In [7]:
encoder = LabelEncoder()

In [8]:
encoder.fit(data) #encoding해줄 데이터를 정리개념! 
# 어떤 것을 어떤 번호로 인코딩해야할지 정하는 역할
# 가을(0), 겨울(1), 봄(2), 여름(3)

LabelEncoder()

In [9]:
encoder.classes_

array(['가을', '겨울', '봄', '여름'], dtype=object)

In [13]:
변환할컬럼 = ['가을', '겨울', '봄', '여름',  '봄', '여름', '겨울', '봄', '여름',  '봄', '여름']

In [14]:
target = pd.Series(변환할컬럼)
target

0     가을
1     겨울
2      봄
3     여름
4      봄
5     여름
6     겨울
7      봄
8     여름
9      봄
10    여름
dtype: object

In [17]:
target2 = encoder.transform(target)
print(target2, type(target2))

[0 1 2 3 2 3 1 2 3 2 3] <class 'numpy.ndarray'>

In [21]:
# inverse : 꺼꾸로 되돌리다.
array1 = [ 1, 3, 4, 5, 7, 8, 9]
list.reverse(array1)
array1

[9, 8, 7, 5, 4, 3, 1]

In [23]:
target3 = encoder.inverse_transform(target2)
target3

array(['가을', '겨울', '봄', '여름', '봄', '여름', '겨울', '봄', '여름', '봄', '여름'],
      dtype=object)

In [25]:
## 라벨 인코딩할 컬럼이 2-3개인 경우

In [26]:
words = ['apple', 'summer', 'summer', 'spring', 'spring']
hobby = ['book', 'run','talk','coffee','song']

In [27]:
df = pd.DataFrame({
        'words' : words,
        'hobby' : hobby
})
df

    words   hobby
0   apple    book
1  summer     run
2  summer    talk
3  spring  coffee
4  spring    song

In [28]:
encoder2 = LabelEncoder()

In [29]:
col = df.columns
col

Index(['words', 'hobby'], dtype='object')

In [30]:
for c in col:
    df[c] = encoder2.fit_transform(df[c])

In [31]:
df

   words  hobby
0      0      0
1      2      2
2      2      4
3      1      1
4      1      3

In [ ]:
# 나이(100, 200, 300): 연속적인 숫자 => 라벨인코딩의 대상이 되지 않음.
# 나이대(어린이, 성년, 노년): 연속적인 숫자가 아님 => 라벨인코딩의 대상이 됨. category

In [32]:
### 원핫 인코딩! ###
### 라벨인코딩: 연속형이 아닌 데이터를 원하는 형태의 숫자로 바꾸어주는 것!
###                  1) 연속형이 아닌 데이터를 숫자로 변환: LabelEncodertt사용
###                     fit()--transform(), fit_transform()
###                  2) 숫자로만 변환하는 경우, 컴퓨터는 연속형 숫자로 오해하여 연산수행하여
###                      의도치않은 결과가 나올 수 있음.해당됨을 나타나게 하기 위해 
###                      라벨의 갯수만큼 컬럼을 만들어주고 해당되는 라벨에 표시(1)로 해주는 방법을 사용
###                      원핫인코딩

In [33]:
data2 = pd.Series(['apple', 'summer', 'spring', 'summer', 'spring'])
data2

0     apple
1    summer
2    spring
3    summer
4    spring
dtype: object

In [34]:
data2.unique()

array(['apple', 'summer', 'spring'], dtype=object)

In [35]:
pd.get_dummies(data2)

   apple  spring  summer
0      1       0       0
1      0       0       1
2      0       1       0
3      0       0       1
4      0       1       0

In [36]:
df2 = pd.DataFrame({"words" : ['apple', 'summer', 'summer', 'spring', 'spring'], 
                    "hobby" : ['book', 'run','talk','coffee','song']})
df2

    words   hobby
0   apple    book
1  summer     run
2  summer    talk
3  spring  coffee
4  spring    song

In [37]:
pd.get_dummies(df2['hobby'])

   book  coffee  run  song  talk
0     1       0    0     0     0
1     0       0    1     0     0
2     0       0    0     0     1
3     0       1    0     0     0
4     0       0    0     1     0

In [38]:
pd.get_dummies(df2['words'])

   apple  spring  summer
0      1       0       0
1      0       0       1
2      0       0       1
3      0       1       0
4      0       1       0

In [39]:
pd.get_dummies(df2)

,words_apple,words_spring,words_summer,hobby_book,hobby_coffee,hobby_run,hobby_song,hobby_talk
0,1,0,0,1,0,0,0,0
1,0,0,1,0,0,1,0,0
2,0,0,1,0,0,0,0,1
3,0,1,0,0,1,0,0,0
4,0,1,0,0,0,0,1,0

In [43]:
df2.loc[:, ['words','hobby']]

    words   hobby
0   apple    book
1  summer     run
2  summer    talk
3  spring  coffee
4  spring    song

In [44]:
pd.get_dummies(df2.loc[:, ['words','hobby']])

,words_apple,words_spring,words_summer,hobby_book,hobby_coffee,hobby_run,hobby_song,hobby_talk
0,1,0,0,1,0,0,0,0
1,0,0,1,0,0,1,0,0
2,0,0,1,0,0,0,0,1
3,0,1,0,0,1,0,0,0
4,0,1,0,0,0,0,1,0

In [45]:
drinks = pd.read_csv('../csv-data/drinks.csv', encoding='utf-8')
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [46]:
drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [47]:
drinks['beer_cat'] = pd.cut(drinks['beer_servings'],
                                            bins = [0, 76, 188, 376],
                                            include_lowest=True,
                                            labels= ['low','middle','high']
                            )
drinks['beer_cat'][:5]

0       low
1    middle
2       low
3      high
4      high
Name: beer_cat, dtype: category
Categories (3, object): ['low' < 'middle' < 'high']

In [48]:
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent', 'beer_cat'],
      dtype='object')

In [49]:
drinks[:5]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,beer_cat
0,Afghanistan,0,0,0,0.0,AS,low
1,Albania,89,132,54,4.9,EU,middle
2,Algeria,25,0,14,0.7,AF,low
3,Andorra,245,138,312,12.4,EU,high
4,Angola,217,57,45,5.9,AF,high